import re 

alphabet ={
"а": "a",
"б": "b",
"в": "v",
"г": "g",
"д": "d",
"е": "e",
"ё": "e",
"ж": "j",
"з": "z",
"и": "i",
"й": "j",
"к": "k",
"л": "l",
"м": "m",
"н": "n",
"о": "o",
"п": "p",
"р": "r",
"с": "s",
"т": "t",
"у": "u",
"ф": "f",
"х": "h",
"ц": "cs",
"ч": "ch",
"ш": "sh",
"щ": "sh",
"ы": "i",
"э": "e",
"ю": "yu",
"я": "ya",
"А": "A",
"Б": "B",
"В": "V",
"Г": "G",
"Д": "D",
"Е": "E",
"Ё": "E",
"Ж": "J",
"З": "Z",
"И": "I",
"Й": "J",
"К": "K",
"Л": "L",
"М": "M",
"Н": "N",
"О": "O",
"П": "P",
"Р": "R",
"С": "S",
"Т": "T",
"У": "U",
"Ф": "F",
"Х": "H",
"Ц": "CS",
 "Ч": "CH",
"Ш": "SH",
"Щ": "SH",
"Ы": "I",
"Э": "E",
"Ю": "YU",
"Я": "YA",
}


def repl(text):
    splitted = list(text)
    end_text =""
    for letter in splitted:
        try:
            end_text += alphabet[letter]
        except KeyError:
            end_text += "_"    

    
    print(end_text)
repl("не соответствовать стандарт")     



    